Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

data=pd.Series([4, 8, 15, 16, 23,  42])
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
import pandas as pd

my_list=[1,2,5,7,9,5,4,3,6,1]
series=pd.Series(my_list)
print(series)

0    1
1    2
2    5
3    7
4    9
5    5
6    4
7    3
8    6
9    1
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [4]:
import pandas as pd

my_dict={'name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['female','male','female']}
my_dict





df=pd.DataFrame(my_dict)
print(df)
df

     name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

     name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.


In pandas, a DataFrame is a two-dimensional, tabular data structure that is similar to a spreadsheet or SQL table. It consists of rows and columns, where each column can have a different data type. The DataFrame is a primary data structure in pandas and is widely used for data manipulation and analysis.

On the other hand, a Series is a one-dimensional array-like object in pandas. It can be thought of as a single column of a DataFrame. A DataFrame is essentially a collection of Series objects that share the same index.

Here's an example to illustrate the difference between a DataFrame and a Series:

In [5]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 22],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}

df = pd.DataFrame(data)

# Displaying the DataFrame
print("DataFrame:")
print(df)

DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas provides a wide range of functions to manipulate and analyze data in a DataFrame. Here are some common functions:

head() and tail():

head(n) returns the first n rows of the DataFrame.
tail(n) returns the last n rows of the DataFrame.

In [6]:
# Display the first 3 rows
df.head(3)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles

describe():

describe() generates descriptive statistics, including measures of central tendency, dispersion, and shape of the distribution.

In [7]:
# Display summary statistics for numerical columns
df.describe()

             Age
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000

info():

info() provides a concise summary of the DataFrame, including the data types and missing values.

In [8]:
# Display information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

shape:

shape returns a tuple representing the dimensions of the DataFrame (number of rows, number of columns).

In [9]:
# Display the dimensions of the DataFrame
print("DataFrame shape:", df.shape)

DataFrame shape: (3, 3)

loc[] and iloc[]:

loc[] is label-based indexing, and iloc[] is integer-based indexing. They are used for selecting rows and columns.

In [10]:
# Select rows 1 to 3 and columns 'Name' and 'Age'
subset = df.loc[1:3, ['Name', 'Age']]

set_index() and reset_index():

set_index('column_name') sets a specific column as the DataFrame index.
reset_index() resets the index to the default integer index.

In [11]:
# Set 'Name' column as the index
df.set_index('Name', inplace=True)

drop():

drop(labels, axis=0/1, inplace=True) is used to remove rows or columns from the DataFrame.

In [13]:
# Drop the 'City' column
df.drop('City', axis=1, inplace=True)

sort_values():

sort_values(by='column_name') sorts the DataFrame by the values in a specific column.

In [12]:
# Sort the DataFrame by 'Age' in ascending order
df.sort_values(by='Age', inplace=True)

groupby():

groupby('column_name') groups the DataFrame by a specific column, allowing for aggregate functions on each group.

In [14]:
# Group by 'City' and calculate the mean age in each city
avg_age_by_city = df.groupby('City')['Age'].mean()

KeyError: 'City'

merge():

merge() combines two DataFrames based on a common column or index

In [15]:
# Merge two DataFrames based on the 'Name' column
merged_df = pd.merge(df1, df2, on='Name')

NameError: name 'df1' is not defined

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


In pandas, both Series and DataFrame are mutable, meaning that you can modify their content after creation. On the other hand, the Panel is deprecated and has been removed from recent versions of pandas (as of my last knowledge update in January 2022). Therefore, for modern pandas versions, the primary mutable structures are Series and DataFrame.

Here's a brief explanation for each:

Mutable: Series

A Series is a one-dimensional array-like object in pandas.
Elements in a Series can be modified using their index.

In [16]:
import pandas as pd

# Create a Series
s = pd.Series([1, 2, 3])

# Modify an element
s[1] = 5

Mutable: DataFrame

A DataFrame is a two-dimensional tabular data structure.
You can modify values in specific cells, add or remove columns, and change the structure of the DataFrame.

In [17]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Modify a value
df.at[0, 'A'] = 10

# Add a new column
df['C'] = [7, 8, 9]

# Remove a column
df.drop('B', axis=1, inplace=True)

Deprecated: Panel (as of my last knowledge update)

The Panel was a three-dimensional data structure in pandas, but it has been deprecated and removed from recent versions.
Panel was replaced by the more flexible MultiIndex for handling three-dimensional data.

 Deprecated: Panel
Instead, use MultiIndex with DataFrame for 3D data

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
import pandas as pd
sr={'name':pd.Series(['Eleven','kate','ana']),'age':pd.Series([26,27,25]),'city':pd.Series(['new jersey','arizona','san fransisco'])}
df1=pd.DataFrame(sr)
df1

     name  age           city
0  Eleven   26     new jersey
1    kate   27        arizona
2     ana   25  san fransisco